#include <stdio.h>
//-----------------------------------------------------------------------//

//数据类型                       占的字节（byte）   byte = 8bit
// char 字符数据类型                1
// short 短整型                     2
// int 整型                         4
// long 长整型                      4
// long long 更长的整型             8
// float 单精度浮点数               4
// double 双精度浮点数              8
// sizeof - 关键字 - 操作符 - 计算类型或者变量所占空间的大小

//-----------------------------------------------------------------------//

// 局部变量的作用域:变量所在的局部范围
// 全局变量：整个工程

// extern int g_1; //在不同文件中引用变量
// int global = 2023; //全局变量
// int main()
// {
//     int local = 2022; //局部变量
//     int global = 2021; //局部变量
//     printf("global = %d\n",global); //打印2021 : 在同一个括号里面寻找相应值
//     printf("g_1 = %d\n",g_1);
//     // {
//     //     int a = 10;
//     // }
//     // printf("a = %d\n",a); //报错
//     return 0;

// }

//-----------------------------------------------------------------------//
//常量

// 1.const修饰的常变量
// int main ()
// {
//     const int num=10; //num就是常变量
//     // num = 20; 报错:此时num已经不能改变值,但是num仍然是变量属性
//     printf("num = %d\n",num);
// }

// 2.#define定义的标识符常量
// #define MAX 10000
// int main()
// {
//     // MAX = 2000;  报错：已经是标识符常量，不能更改
//     int n = MAX;
//     printf("n = %d\n",n);
//     return 0; 
// }

// 3.枚举常量 : 
// enum Sex
// {
//     //这种枚举类型的变量的未来可能取值
//     MALE, //可以赋初值：默认为0
//     FEMALE=2,
//     SECRET
// };
// int main()
// {
//     enum Sex s=MALE; //只能取枚举变量中的值
//     printf("%d\n",MALE);
//     printf("%d\n",FEMALE);
//     printf("%d\n",SECRET);
//     return 0;

// }

//-----------------------------------------------------------------------//
//字符串 - 双引号引起来的一串字符 (注：字符串的结束标志是\0的转义字符，但是不算做字符串内容)

// #include <string.h>
// int main()
// {
//     // char arr1[]='abc' 字符常量视为int型,不能直接用'abc'进行赋值操作
//     char arr1[]="abc";
//     char arr2[]={'a','b','c'};
//     char arr3[]={'a','b','c','\0'};
//     int len1 = strlen(arr1);
//     int len2 = strlen(arr2);
//     int len3 = strlen(arr3);

//     printf("%d\n",len1); //遇到字符串结束标志\0就结束
//     printf("%d\n",len2); //打印随机值
//     printf("%d\n",len3); //遇到字符串结束标志\0就结束
//     return 0;
// }
//-----------------------------------------------------------------------//