#include <stdio.h>
// 指针初阶

//-------------------------------------------------------------------------
// 指针的大小在32位平台是4个字节，在64位平台是8个字节

// int main()
// {
//     int a = 0; // a占4个字节(bity), 每个字节8个比特位(bit)， 每个比特位(bit)一个二进制位
//     int *pa = &a; // 拿到的是a的4个字节中的第一个字节
//     *pa = 20;
//     return 0;
// }


// 指针与指针类型
// 1.指针类型决定了：指针解引用的权限大小
// int main()
// {
//     int *pa;
//     char *pc;
//     float *pf;
//     printf("%d\n",sizeof(pa));
//     printf("%d\n",sizeof(pc));
//     printf("%d\n",sizeof(pf)); 
//     // 打印出来大小均为4个字节

//     int a = 0x11223344; // 0x表示16进制 , 每个数字占4个二进制数(2 ^ 4 = 16) , 一共8个数字占32个bit、4个字节 , 刚好是int类型占的字节数
//     int b = 0x11223344;
//     int *p1 = &a; // int类型的指针可解引用4个字节
//     *p1 = 0; // 赋值后a中的4个字节均变为0
//     char *p2 = &b; // char类型的指针可解引用1个字节
//     *p2 = 0; // 赋值后b中的第一个字节变为0
//     return 0;
// }

// 2.指针类型决定了:指针步长
// int main()
// {
//     int arr[10] = {0};
//     int *p = arr;
//     char *pc = arr;
//     double *pd = arr;
//     // %p打印地址
//     printf("%p\n", p);   // 000000000061FDE0
//     printf("%p\n", p+1); // 000000000061FDE4

//     printf("%p\n", pc);  // 000000000061FDE0
//     printf("%p\n", pc+1);// 000000000061FDE1

//     printf("%p\n", pd);  // 000000000061FDE0
//     printf("%p\n", pd+1);// 000000000061FDE8
//     return 0;
// }

//-------------------------------------------------------------------------
// 野指针

// 野指针成因
// 1.指针未初始化 -> 当前不清楚p应该初始化为什么地址时，直接初始化为NULL
// int main()
// {
//     int *p; // p是一个局部的指针变量，局部变量不初始化时默认是随机值
//     *p = 20;
//     return 0;
// }

// 2.指针越界访问 
// int main()
// {
//     int arr[10] = {0};
//     int *p = arr;
//     int i = 0;
//     for (i = 0; i <= 11 ; i++)
//     {
//         *p = i;
//         p++;
//     }
//     return 0;
// }

// 3.指针指向的空间释放 -> 及时置NULL
// 加入判断语句: if (p != NULL) 

//-------------------------------------------------------------------------
// 指针运算
// 指针+-整数 指针+-指针 指针的关系运算

// 指针+-整数
// int main()
// {
//     int arr[10] = {1,2,3,4,5,6,7,8,9,10};
//     int *p = arr;
//     int *pend = arr + 9;
//     while(p < pend)
//     {
//         printf("%d\n", *p);
//         p++;
//     }
//     return 0;
// }

// 指针+-指针
// 指针 - 指针 = 两个指针之间的个数
// demo(1)
// int main()
// {
//     int arr[10] = {1,2,3,4,5,6,7,8,9,10};
//     printf("%d\n", &arr[9] - &arr[0]);
//     return 0;
// }

// demo(2)计算字符串长度
// int my_strlen(char *str) // 字符串常量在函数调用时会自动转换为指向首字符的指针
// {
//     char *start = str;
//     while(*str != '\0')
//     {
//         str++;
//     }
//     return str-start;
// }
// int main()
// {
//     int len = my_strlen("abc");
//     printf("%d\n", len);
//     return 0;
// }

//-------------------------------------------------------------------------
// 二级指针
// int mian()
// {
//     int a = 10;
//     int *pa = &a; // 一级指针， * 代表告诉 pa 是指针，前面的 int 代表指向的对象是 int 类型
//     int* *ppa = &pa; // 二级指针， 第二 * 代表告诉 ppa 是指针， 第一 int* 代表告诉 ppa指针 指向的对象是 int* 类型
//     int** *pppa = &ppa; 
//     return 0;
// }

//-------------------------------------------------------------------------
// 指针数组 -> 本质是数组， 存放的是指针的数组
// int main()
// {
//     int arr[10]; // 整型数组 -> 存放整型的数组就是整型数组
//     char ch[5]; // 字符数组 -> 存放的是字符
//     int* parr[5]; // 整型指针的数组
//     return 0;
// }