// 操作符详解
#include <stdio.h>
//-----------------------------------------------------------------------//

// 算数操作符  + - * / %
// 1. 除了 % 操作符之外 ， 其他的操作符可以作用于整数和浮点数
// 2.对于 / 操作符 -> 操作数为整数 ， 执行整数除法 。 操作数为浮点数 ， 执行浮点数除法 。
// 3. 对于 % 操作符 -> 两个操作数必须为整数

//-----------------------------------------------------------------------//

// 移位操作符 >> <<
// int main()
// {
//     int a = 2; // int 类型一共4个字节 ， 32个比特位
//     // 正整数存放阿紫内存中的形式为原码
//     // 正整数的原码、补码、反码相同
//     // 把a的二进制位向左移动一位
//     // 即 00000000000000000000000000000010 -> 00000000000000000000000000000100
//     int b = a << 1; 
//     printf("b = %d\n", b);

//     int c = 10; 
//     // 把c的二进制位向右移动一位
//     // 即 00000000000000000000000000001010 -> 00000000000000000000000000000101
//     int d = c >> 1; 
//     printf("d = %d\n", d);

//     int e = -1; 
//     // 负数存放在内存中的形式为补码
//     // 整数的二进制表示方法 -> 原码：直接根据数值写出的二进制序列 反码：原码的符号位不变，其他位按位取反 补码：反码+1
//     // 把e的二进制位向右移动一位
//     // e的原码 10000000000000000000000000000001
//     // e的反码 11111111111111111111111111111110
//     // e的补码 11111111111111111111111111111111
//     int f = e >> 1; 
//     // 右移： 11111111111111111111111111111111 -> 11111111111111111111111111111111 (算数右移 ， 不填0而是1)
//     printf("f = %d\n", f);
//     return 0;
// }

//-----------------------------------------------------------------------//

// 位操作符 & | ^
// int main()
// {
//     int a = 3;
//     int b = 5;
//     // & -> 按(二进制)位与
//     int c = a & b;
//     // a的二进制 -> 00000000000000000000000000000011
//     // b的二进制 -> 00000000000000000000000000000101
//     // c的二进制 -> 00000000000000000000000000000001
//     printf("c = %d\n", c);

//     // | -> 按(二进制)位或
//     int d = a | b;
//     // a的二进制 -> 00000000000000000000000000000011
//     // b的二进制 -> 00000000000000000000000000000101
//     // c的二进制 -> 00000000000000000000000000000111
//     printf("d = %d\n", d);

//     // ^ -> 按(二进制)异或 -> 相同为0，相异为1
//     int e = a ^ b;
//     // a的二进制 -> 00000000000000000000000000000011
//     // b的二进制 -> 00000000000000000000000000000101
//     // c的二进制 -> 00000000000000000000000000000110
//     printf("e = %d\n" , e);

//     // 异或与的理论基础 -> a ^ a = 0  and  0 ^ a = a
//     // 异或与的应用 -> 不创建第三个变量交换两个值
//     int x = 2;
//     int y = 5;
//     x = x ^ y;
//     y = x ^ y; // 相当于 y = x ^ y ^ y = x ^ 0 = x
//     x = x ^ y; // 相当于 x = x ^ y ^ x ^ y ^ y =  y
//     printf("x = %d\n", x);
//     printf("y = %d\n", y);
//     return 0;
// }

//-------------------------------------------------------------------------
// 单目操作符

// & -> 地址操作符 * -> 解引用操作符(间接访问操作符)
// int main()
// {
//     int a = 10;
//     int *pa = &a; // pa是用来存放地址的 ， pa就是一个指针变量
//     *pa = 20; // 解引用操作符
//     printf("%d\n", a);
//     return 0;
// }

// (类型) -> 强制类型转换
// int main()
// {
//     int a = (int)3.14;
//     printf("%d\n", a);
//     return 0;
// }

// sizeof与数组
// void test1(int arr[])
// {
//     printf("%d\n", sizeof(arr));
// }
// void test2(char ch[])
// {
//     printf("%d\n", sizeof(ch));
// }
// int main()
// {
//     int arr[10] = {0};
//     char ch[10] = {0};
//     printf("%d\n", sizeof(arr)); // -> 40
//     printf("%d\n", sizeof(ch)); // -> 10
//     test1(arr); // -> 4 (32位系统指针变量大小为4 ，64位系统指针变量大小为8)
//     test2(ch); // -> 4
//     return 0;
// }

// 易错
// int main()
// {
//     int i = 0 , a = 1, b = 2 , c = 3, d = 4;
//     // i = a++ && ++b && d++; // 前面为假 ， 后面不计算
//     i = a++ || ++b || d++; // 前面为真 ， 后面不计算
//     printf("%d %d %d %d %d " ,a ,b, c, d); 
//     return 0;
// }

//-------------------------------------------------------------------------
// 三目操作符

// int main()
// {
//     int a = 3;
//     int b = 0;
//     if (a > 5)
//         b = 1;
//     else
//         b = -1;

//     b = (a > 5 ? 1 : -1);   
//     return 0;
// }

//-------------------------------------------------------------------------
// 逗号表达式

// int main()
// {
//     int a = 3;
//     int b = 5;
//     int c = 0;
//     // 从左向右依次计算，但整个表达式的结果是最后一个表达式的结果
//     int d = (c = 5, a = c + 3 , b = a - 4, c += 5);
//     printf("%d\n", d);
//     return 0;
// }

//-------------------------------------------------------------------------
// 结构成员访问操作符： 1) . -> 结构体.成员名  2) -> -> 结构体指针 -> 成员名

// struct Book
// {
//     char name[20];
//     char id[20];
//     int price;
// };

// int main()
// {
//     int num = 10;
//     struct Book b = {"C语言", "543001", 56}; // b 为 Book结构体的名称
//     struct Book *pb = &b;
//     printf("书名：%s\n", b.name);
//     printf("书号：%s\n", b.id);
//     printf("定价：%s\n", b.price);

//     printf("书名：%s\n", pb->name);
//     printf("书名：%s\n", pb->id);
//     printf("书名：%s\n", pb->price);
//     return 0;
// }

//-------------------------------------------------------------------------
// 表达式求值 ： 隐式类型转换 -> 整型提升
// 整型提升：C的整型算数运算总是至少以缺整型类型的精度进行的，为了获得这个精度，表达式中的字符和短整型操作数在使用之前被转换为普通整型
// 整型提升按照变量的数据类型的符号位来提升的，即第一位来进行提升
// 参与运算的char、short等类型才会发生整型提升

int main()
{
    // a与b都是char类型, 没有达到一个int的大小
    // 会发生整型提升
    char a = 3; // char占一个字节，int占4个字节，每个字节占8个比特位 
    // 00000000000000000000000000000011
    // 00000011 -a
    char b = 127;
    // 00000000000000000000000001111111
    // 01111111 -b

    // a -> 00000000000000000000000000000011
    // b -> 00000000000000000000000001111111
    // c -> 00000000000000000000000010000010
    // 10000010 -c
    // 打印形式为int类型 ， 所以 c 要进行整型提升
    // 111111111111111111111111 10000010 -补码
    // 111111111111111111111111 10000001 -反码
    // 100000000000000000000000 11111110 -原码
    char c = a + b;
    printf("%d\n", c); // 打印形式为int类型 ， 所以c要进行整型提升
    return 0;
}